// --------------------------------------------------------------------------
// ✅ 학습 진행 방향 체크리스트
// --------------------------------------------------------------------------
// - [❌] 마크업 변경 여부
// - [❌] 접근성 준수 여부
// - [🅾️] 성능 최적화 고려 여부
// - [🅾️] 유지보수(재사용성) 고려 여부
// - [🅾️] 모듈(캡슐화, 재사용성) 구성 여부
// --------------------------------------------------------------------------

// --------------------------------------------------------------------------
// ✅ [jQuery → Vanilla Script]
// --------------------------------------------------------------------------
// - [x] jQuery 코드 리뷰
// - [x] jQuery 코드 리팩터링
// - [x] Vanilla Script 버전 작성
// - [x] 재사용성을 고려한 설계 (함수 중심)
// - [x] 재사용성을 고려한 설계 (클래스 중심)
// --------------------------------------------------------------------------


/* -------------------------------------------------------------------------- */
/* no module                                                                  */
/* -------------------------------------------------------------------------- */
// import './ui/tabs.js';

/* -------------------------------------------------------------------------- */
/* module: function                                                           */
/* -------------------------------------------------------------------------- */
// import createTabs from './ui/createTabs.js';
// createTabs('.tabs');

/* -------------------------------------------------------------------------- */
/* module: class                                                              */
/* -------------------------------------------------------------------------- */
import Tabs from './ui/class/Tabs.js';

const tabs = new Tabs('.tabs');

let autoPlay = true;
let timeout = 1000;

if (autoPlay) {
  setTimeout(() => {
    console.log('2번째 탭 활성화');
    tabs.active(1);
  }, timeout);
  
  setTimeout(() => {
    console.log('1번째 탭 활성화');
    tabs.active(0);
  }, timeout * 2);
  
  setTimeout(() => {
    console.log('3번째 탭 활성화');
    tabs.active(2);
  }, timeout * 3);
  
  setTimeout(() => {
    console.log('모든 탭 비활성화');
    tabs.deactive();
  }, timeout * 4);
}